In [0]:
import pandas as pd
import numpy as np

Extract first n characters from left of column in pandas python

In [0]:
df1 = {
    'State':['Arizona AZ','Georgia GG','Newyork NY','Indiana IN','Florida FL'],
   'Score':[62,47,55,74,31]}
 
df1 = pd.DataFrame(df1,columns=['State','Score'])
print(df1)

        State  Score
0  Arizona AZ     62
1  Georgia GG     47
2  Newyork NY     55
3  Indiana IN     74
4  Florida FL     31

In [0]:
df1['StateInitial'] = df1['State'].str[:2]
print(df1)

        State  Score StateInitial
0  Arizona AZ     62           Ar
1  Georgia GG     47           Ge
2  Newyork NY     55           Ne
3  Indiana IN     74           In
4  Florida FL     31           Fl

Extract last n characters from right of the column in pandas python

In [0]:
df1['Statefinal'] = df1['State'].str[-2:]
print(df1)

        State  Score StateInitial Statefinal
0  Arizona AZ     62           Ar         AZ
1  Georgia GG     47           Ge         GG
2  Newyork NY     55           Ne         NY
3  Indiana IN     74           In         IN
4  Florida FL     31           Fl         FL

Replace a substring with another substring in pandas

In [0]:
df1.replace(regex=['zona'], value='Arizona')

           State  Score StateInitial Statefinal
0  AriArizona AZ     62           Ar         AZ
1     Georgia GG     47           Ge         GG
2     Newyork NY     55           Ne         NY
3     Indiana IN     74           In         IN
4     Florida FL     31           Fl         FL

Replace space with underscore:

In [0]:
df1.replace(regex=" ", value='_')

        State  Score StateInitial Statefinal
0  Arizona_AZ     62           Ar         AZ
1  Georgia_GG     47           Ge         GG
2  Newyork_NY     55           Ne         NY
3  Indiana_IN     74           In         IN
4  Florida_FL     31           Fl         FL

Replace a pattern of substring using regular expression:

In [0]:
df1.replace(regex=['^.'],value='HE')

         State  Score StateInitial Statefinal
0  HErizona AZ     62          HEr        HEZ
1  HEeorgia GG     47          HEe        HEG
2  HEewyork NY     55          HEe        HEY
3  HEndiana IN     74          HEn        HEN
4  HElorida FL     31          HEl        HEL

Regular expression Replace of substring of a column in pandas python

In [0]:
df2={
    'state':["Tom","Dick","Harry"],
    'Score':[0,1,2]
}

print(df2)
df3=pd.DataFrame(df2,columns=['state','Score'])
print(df3)

{'state': ['Tom', 'Dick', 'Harry'], 'Score': [0, 1, 2]}
   state  Score
0    Tom      0
1   Dick      1
2  Harry      2

Replace last character of string of column in pandas python

In [0]:
df3.replace(regex=['(.)$'],value='HE')

    state  Score
0    ToHE      0
1   DicHE      1
2  HarrHE      2

Repeat or replicate the rows of dataframe in pandas python:

In [0]:
df_repeat=pd.concat([df3]*3,ignore_index=True)
print(df_repeat)

   state  Score
0    Tom      0
1   Dick      1
2  Harry      2
3    Tom      0
4   Dick      1
5  Harry      2
6    Tom      0
7   Dick      1
8  Harry      2

6-10

Reverse the rows of the dataframe in pandas python

In [0]:
df3.iloc[::-1]

   state  Score
2  Harry      2
1   Dick      1
0    Tom      0

Reverse the column of the dataframe in pandas python

In [0]:
df3[df3.columns[::-1]]

   Score  state
0      0    Tom
1      1   Dick
2      2  Harry

9 - Square of the column in pandas python

In [0]:
df3['score_value'] = df3['Score']**2
print(df3)

   state  Score  score_value
0    Tom      0            0
1   Dick      1            1
2  Harry      2            4

10 - Sqroot

In [0]:
df3['score_value_root'] = df3['Score']**1/2
print(df3)

   state  Score  score_value  score_value_root
0    Tom      0            0               0.0
1   Dick      1            1               0.5
2  Harry      2            4               1.0

11 - Logical and operation of column in pandas python

In [0]:
#import pandas as pd
#import numpy as np
 
df4 = {
    'State':['Arizona AZ','Georgia GG','Newyork NY','Indiana IN','Florida FL'],
   'Score1':[4,47,55,74,41],
   'Score2':[5,67,54,56,12]}
 
df4 = pd.DataFrame(df4,columns=['State','Score1','Score2'])
print(df4)

        State  Score1  Score2
0  Arizona AZ       4       5
1  Georgia GG      47      67
2  Newyork NY      55      54
3  Indiana IN      74      56
4  Florida FL      41      12

In [0]:
df4['Pass_Status'] = np.logical_and(df4['Score1'] > 40,df4['Score2'] > 40)
print(df4)

        State  Score1  Score2  Pass_Status
0  Arizona AZ       4       5        False
1  Georgia GG      47      67         True
2  Newyork NY      55      54         True
3  Indiana IN      74      56         True
4  Florida FL      41      12        False

In [0]:
df4['Pass_Status_or'] = np.logical_or(df4['Score1'] > 40,df4['Score2'] > 40)
print(df4)

        State  Score1  Score2  Pass_Status  Pass_Status_or
0  Arizona AZ       4       5        False           False
1  Georgia GG      47      67         True            True
2  Newyork NY      55      54         True            True
3  Indiana IN      74      56         True            True
4  Florida FL      41      12        False            True

13 - Cube root

In [0]:
df4['Score_cuberoot']=df4['Score2']**1/3
print(df4)

        State  Score1  Score2  Pass_Status  Pass_Status_or  Score_cuberoot
0  Arizona AZ       4       5        False           False        1.666667
1  Georgia GG      47      67         True            True       22.333333
2  Newyork NY      55      54         True            True       18.000000
3  Indiana IN      74      56         True            True       18.666667
4  Florida FL      41      12        False            True        4.000000

Reorder

In [0]:
df5=df4.reindex(columns=('Score2','Score1','Pass_Status_or','Pass_Status'))
print(df5)

   Score2  Score1  Pass_Status_or  Pass_Status
0       5       4           False        False
1      67      47            True         True
2      54      55            True         True
3      56      74            True         True
4      12      41            True        False

In [0]:
df5= df4.reindex([2,1,0,3,4])
print(df5)

        State  Score1  Score2  Pass_Status  Pass_Status_or  Score_cuberoot
2  Newyork NY      55      54         True            True       18.000000
1  Georgia GG      47      67         True            True       22.333333
0  Arizona AZ       4       5        False           False        1.666667
3  Indiana IN      74      56         True            True       18.666667
4  Florida FL      41      12        False            True        4.000000

general functions

In [0]:
#pd.datetime(today or now)//datetime

#df['state_new']='USA-'+ df['state'].df.str() //concat

#df1['is_equal'] =( df1['State'].str.lower().str.replace('s/+',"") == df1['State_1'].str.lower().str.replace('s/+',""))//string comp check

#df1.sort_values('State',inplace=True)//Sort state column

#df1.groupby(['State'])['Sales'].sum()
#eg gwalior - 5 if present table 5 times with sales 1 , total becomes 5.
#df1.groupby(['State','Name'])['Sales'].sum()
#mean, count, maximum,minimum could be applied to grpby

#left pad
#right pad


#df.shape()
#df.size()

#df.dropna()


#handling missing values.
#df1.fillna(0)
#df1.dropna()